import React from "react";


export default {
    extract: (company, isTabletOrMobileDevice = false) => {
        switch (company) {
            case "deloitte":
                return (
                    <div>
                        У 2020 році <b>«Делойт»</b> відзначає своє 175-річчя. Маленька бухгалтерська фірма у Лондоні, яку 1845 року відкрив Вільям Вельш Делойт, сьогодні є найбільшою компанією з надання професійних послуг у світі та об'єднує понад 312 тисяч співробітників у 150 країнах! Ми супроводжували своїх клієнтів у ключові моменти становлення світової економіки. І продовжимо здійснювати вплив, що має значення – для наших клієнтів, співробітників і суспільства – у майбутньому. Наша спадщина – це лише початок шляху.

                        <br/><br/>

                        <b>«Делойт»</b> продовжує бути найбільшою компанією в світі з надання професійних послуг із сукупними доходами 46,2 млрд дол. США за 2019 фінансовий рік. Завдяки глобальній мережі фірм-учасників <b>«Делойт»</b> відкриває своїм клієнтам можливості світового класу та надає високоякісні послуги, спрямовуючи свої зусилля на досягнення результатів, що мають значення.

                        <br/><br/>

                        Приєднуйся до нас на Facebook – <a href="https://www.facebook.com/DeloitteUA/?brand_redir=219292124840662" target="_blank">@DeloitteUA</a>, Спілкуйся з нашим чат-ботом D.TalCa у Telegram - <a href="https://t.me/DeloitteTalentBot" target="_blank">@DeloitteTalentBot</a> та дізнавайся про можливості в «Делойт» першим."
                    </div>
                );

            case "jooble":
                return (
                    <div>
                        Продукт компанії - сайт з пошуку роботи, щоденна аудиторія якого становить понад 4,5 млн. користувачів.

                        <br/><br/>

                        Головна місія <b>Jooble</b> - допомагати людям знаходити роботу мрії.

                        <br/><br/>

                        Всередині <b>Jooble</b> не існує бюрократії, нудного дрес-коду, складної ієрархії та мікроконтролю. Натомість панує відкритість до ідей співробітників, реальна можливість впливати на розвиток бізнесу, командний дух та єдність у цінностях. <b>Jooble</b> створює оточення однодумців і постійно працює на поповнення команди. З постійно відкритих 50 вакансій майже кожен зможе найти для себе щось надзвичайно цікаве.

                        <br/><br/>

                        <b>Особливо чекаємо на:</b>
                        <ul>
                            <li>
                                Менеджера з продажів
                            </li>
                            <li>
                                Менеджера по роботі з партнерами (треба знати іноземні мови)
                            </li>
                            <li>
                                Customer Support
                            </li>
                        </ul>

                        <b>Чекаємо на вас!</b> <br/>
                        <a href={"https://hiring.jooble.org/"} target="_blank">https://hiring.jooble.org/</a>
                    </div>
                );

            case "ey":
                return (
                    <div>
                        <b>Хто ми? EY</b> – це міжнародна компанія, яка надає послуги у сфері аудиту, оподаткування, супроводу угод і консультування, а також є одним із найкращих роботодавців у світі. Щороку в українському офісі ми працевлаштовуємо понад 150 студентів і випускників без досвіду роботи і можливістю поєднувати навчання та роботу.

                        <br/><br/>

                        Робота в EY цікава і вимагає повної віддачі. Тут ти завжди зможеш розраховувати на надійну підтримку досвідчених колег. Тому, якщо хочеш приєднатись до команди професіоналів, – підисуйся на наші оновлення в Фейсбуці та Інстаграмі – <b>@EYCareers Ukraine.</b>

                        <br/><br/>

                        <b>Пропонуємо вакансії Стажерів до напрямів послуг:</b>
                        <ul>
                            <li>
                                аудит
                            </li>
                            <li>
                                консалтинг з оподаткування
                            </li>
                            <li>
                                оцінки бізнесу
                            </li>
                            <li>
                                HR консалтинг
                            </li>
                            <li>
                                бухгалтерія
                            </li>
                            <li>
                                міжнародне оподаткування
                            </li>
                            <li>
                                трансфертне ціноутворення
                            </li>
                            <li>
                                консалтинг у галузі сталого розвитку
                            </li>
                            <li>
                                підвищення ефективності бізнесу
                            </li>
                            <li>
                                ризиків
                            </li>
                            <li>
                                IT ризиків
                            </li>
                        </ul>

                        <a href={"www.ey.com"}>www.ey.com</a> <br/>
                        Facebook: <a href={"https://www.facebook.com/EYCareersUkraine/"} target="_blank">EY Careers Ukraine</a> <br/>
                        Instagram: <a href={"https://www.instagram.com/eycareersukraine/"} target="_blank">@eycareersukraine</a> <br/>
                        +380 44 490 30 26
                    </div>
                );

            case "aegis":
                return (
                    <div>
                        <b>Dentsu Aegis Network Ukraine</b> – це міжнародна комунікаційна група, яка займається розміщенням реклами. Ми будуємо бренди і розвиваємо їх в нашій країні та за її межами. За даними Всеукраїнської Рекламної Коаліції сумарні обороти агентств Dentsu Aegis Network Ukraine є найбільшими в Україні. Ми - №1 вже протягом 4 років і продовжуємо зберігати лідерство.

                        <br/><br/>

                        Наша компанія надає можливості для розвитку в дуже різних напрямках. Ґрунтовний досвід студенти можуть отримати у сфері client сервісу, аналітики, планування, стратегії, research, працюючи у діджиталі чи перфоманс маркетингу, займаючись лише наружкою, рекламою на ТБ, радіо, або ж повним медійним циклом. Двері компанії відчинені для всіх студентів 4-6 курсів та випускників ВНЗ з досвідом та без досвіду роботи.

                        {/*<b>Dentsu Aegis Network Ukraine</b> – це міжнародна комунікаційна група, яка займається розміщенням реклами. Ми будуємо бренди і розвиваємо їх в нашій країні та за її межами. За даними Всеукраїнської Рекламної Коаліції сумарні обороти агентств <b>Dentsu Aegis Network Ukraine</b> є найбільшими в Україні. Ми - №1 вже протягом трьох років і продовжуємо зберігати лідерство.*/}

                        {/*<br/><br/>*/}

                        {/*Наша компанія надає можливості для розвитку в дуже різних напрямках. Ґрунтовний досвід студенти можуть отримати у сфері client сервісу, аналітики, планування, стратегії, research, працюючи у діджиталі чи перфоманс маркетингу, займаючись лише наружкою, рекламою на ТБ, радіо, або ж повним медійним циклом. Двері компанії відчинені для всіх студентів 4-6 курсів та випускників ВНЗ з досвідом та без досвіду роботи.*/}

                        {/*<br/><br/>*/}

                        {/*<b>*/}
                            {/*Проходь тест та дізнайся, з чого ти можеш почати свою кар'єру в рекламній сфері?*/}
                            {/*Залишай своє CV і з тобою зв'яжеться наш рекрутер!*/}
                        {/*</b> <br/>*/}
                        {/*<a href={"https://cutt.ly/at2lCZt"}>https://cutt.ly/at2lCZt</a>*/}

                        {/*<br/><br/>*/}

                        {/*<a href={"https://dentsuaegis.com.ua/"} target="_blank">https://dentsuaegis.com.ua/</a> <br/>*/}
                        {/*<a href={"hr@dentsuaegis.com.ua"} target="_blank">hr@dentsuaegis.com.ua</a> <br/>*/}
                        {/*<a href={"https://www.facebook.com/dancareer/"} target="_blank">https://www.facebook.com/dancareer/</a> <br/>*/}
                        {/*<a href={"https://www.instagram.com/dan_career/"} target="_blank">https://www.instagram.com/dan_career/</a> <br/>*/}
                    </div>
                );

            case "genesis":
                return (
                    <div>
                        Ми це понад 1500 осіб в 8 країнах, які створюють продукти для 200 мільйонів користувачів в місяць. Генезис – найбільш навантажена IT-компанія в країні і один з найбільших партнерів Facebook, Google, Snapchat іApple з CEE. Це компанія повного циклу, де немає замовників, ми самі створюємо всі свої проекти від ідеї і перших начерків до реалізації та отримання кращих позицій на ринку або в своїй ніші.

                        <br/><br/>

                        <b>Генезис – це унікальне місце для роботи, розвитку і зростання:</b>
                        <ul>
                            <li>
                                Експертиза в розвитку навантажених високотехнологічних продуктів на всіх основних міжнародних ринках;
                            </li>
                            <li>
                                Робота з кращими професіоналами в Україні: унікальні можливості для навчання, розвитку і зростання, а це – тренінги та семінари всередині компанії, доступ до корисної літератури, курси англійської та участь в ключових заходах IT індустрії по всьому світу;
                            </li>
                            <li>
                                Умови для роботи: відмінний офіс в 5 хвилинах від м.Тараса Шевченка, безкоштовна їжа в офісі, безкоштовне медичне страхування, фрукти, заняття бігом, плаванням, футболом, баскетболом і іншими видами спорту.
                            </li>
                        </ul>

                        Ми в постійному діалозі зі студентами. Інвестуємо в освіту молодих фахівців, які хочуть розвиватися в продуктовому IT. Робимо свої школи з таким розрахунком, щоб студенти, які пройшли їх, приєднувалися до нас та інших великих продуктових IT-компаній і робили індустрію сильніше.

                        <br/><br/>

                        Детальніше про нас: <a href={"https://www.gen.tech"} target="_blank">www.gen.tech</a>
                    </div>
                );

            case "innoware":
                return (
                    <div>
                        <b>Innoware</b> - an expert in ERP, CRM, cloud business solutions implementation consulting services, works 19 years and successfully fulfilled more than 300 ERP-projects worldwide. Our company holds <b>Microsoft Gold Certified Partner</b> status and acknowledged as one of the best partners in Eastern Europe.

                        <br/><br/>

                        <b>Our specialization:</b> <br/>
                        ▪ Microsoft Enterprise Resource Planning system (ERP) <br/>
                        ▪ Microsoft Azure cloud platform for business solutions <br/>
                        ▪ Microsoft Dynamics CRM system

                        <br/><br/>

                        We designed a unique training and development system for newcomers, which creates experts in enterprise management systems implementation. We offer <b>Internship Programs</b> for students and fresh graduates in a field of business analysis and development. Internships are conducted quarterly.

                        <br/><br/>

                        Due to expansion of the business, we invite enthusiastic and promising individuals to join our team. Currently we have three positions opened in our company: <br/>

                        ▪ Junior Business Analyst (ERP systems) <br/>
                        ▪ Junior Business Analyst (Intern) <br/>
                        ▪ Junior Developer (Intern)

                        <br/><br/>

                        <b>We offer</b> excellent opportunities for successful career start and growth in friendly, supportive atmosphere: <br/>
                        ▪ Intensive training and professional development <br/>
                        ▪ International Microsoft certification <br/>
                        ▪ Challenging tasks <br/>
                        ▪ Participation in international projects <br/>
                        ▪ Competitive remuneration <br/>
                        ▪ Opportunity to finish education for students

                        <br/><br/>

                        <b>Send your CV to</b> <a href={"mailto:IWwork@innoware.com"} target="_blank">IWwork@innoware.com</a> <br/>
                        <b>More information and vacancies</b> <a href={"https://innoware.com/uk"} target="_blank">https://innoware.com/uk</a>
                    </div>
                );

            case "jti":
                return (
                    <div>
                        <b>JTI</b> Україна є частиною міжнародної тютюнової компанії Japan Tobacco International (JTI). Ми пишаємося бути роботодавцем, який об’єднує 44000 працівників із 70 країн. В JTI ми віримо в свободу – свободу вибору, свободу думок, свободу проявити себе і бути собою. А також ми віримо у те, що успішним може бути лише інноваційний та соціально відповідальний бізнес.

                        <br/><br/>

                        Компанія постійно інвестує в розвиток своїх працівників, тому, за результатами міжнародного дослідження Top Employer 2020 року, JTI є роботодавцем №1 в Україні і входить до Топ-5 кращих у Європі та всьому світі.

                        <br/><br/>

                        В JTI Україна працює близько 800 співробітників на сучасній фабриці у м. Кременчук, у центральному офісі в Києві та в різних містах України.

                        <br/> <br/>

                        <b>Новини про всі можливості на сторінках JTI у соціальних мережах:</b> <br/>
                        <li>facebook.com/jticareersukraine</li>
                        <li>instagram.com/jti_ukraine</li>
                    </div>
                );

            case "pepsico":
                return (
                    <div>
                        <b>Про PepsiСo в Україні</b>

                        <br/><br/>

                        <b>PepsiСo</b> – один із лідерів українського ринку продуктів харчування та напоїв, представлена компаніями «Сандора» і «Вімм-Білль-Данн Україна». Компанія займає провідні позиції на ринку соків і сокової продукції, де представлена брендами «Сандора», «Садочок», «Сандорик». До портфеля компанії входять також газовані напої Pepsi®, 7UP®, Mirinda®, холодний чай Lipton Ice Tea®, мінеральна вода «Аква Мінерале». На ринку снеків компанія представлена брендами Lay's® і «Хрусteam». PepsiСo в Україні також займає впевнені позиції на ринку молочної продукції з брендами «Чудо», «Слов'яночка», «Машенька» та дитячого харчування з брендом «Агуша».

                        <br/><br/>

                        Додаткова інформація про компанію <b>PepsiСo в Україні</b> — на сайті <a href={"www.pepsico.ua"} target="_blank">www.pepsico.ua</a>

                        <br/><br/>

                        Дізнатися більше про наші вакансії ти можеш на сайті <br/> <a href={"https://www.pepsicojobs.com/main/europe/ukraine"} target="_blank">https://www.pepsicojobs.com/main/europe/ukraine</a>
                    </div>
                );

            case "intertop":
                return (
                    <div>
                        Ми — INTERTOP Ukraine. І ми тут, щоб занурити світ у комфортний fashion!

                        <br/><br/>

                        Вже 25 років ми лідери fashion-retail України і представляємо найвідоміші роздрібні магазини: INTERTOP, ECCO, GEOX, CLARKS, TIMBERLAND, SKECHERS, MARC O'POLO, NAPAPIJRI, ARMANI, THE NORTH FACE.

                        <br/><br/>

                        Ми розвиваємо вітчизняну fashion-індустрію, допомагаємо українським спортсменам перемагати та дбаємо про екологію.

                        <br/><br/>

                        <b>INTERfashion</b> <br/>
                        Так, ми — модний трендсетер країни! Тільки задумайся: у нашому портфелі більше 200 відомих світових брендів, а ще власний неповторний бренд Braska. Із 2011 року INTERTOP випустила аж 13 успішних колаборацій зі гучними українськими дизайнерами: POUSTOVIT, KAMENSKAKONONOVA, LAKE STUDIO, BEVZA, ELENA BURBA и CHAKSHYN. А у 2019 році компанія ще й створила першу колекцію одягу разом із дизайнеркою Лілією Пустовіт. Бачиш, ми обожнюємо дивувати та розвивати український fashion!

                        <br/><br/>

                        <b>INTERsport</b> <br/>
                        Ми, зовсім як ти, не вміємо стояти на місці і активно підтримуємо вітчизняний спорт.
                        Уяви, INTERTOP Ukraine стала офіційним партнером Олімпійського Комітету України, а також Федерації легкої атлетики України! І тепер ми будемо розробляти взуття, в якому наші спортсмени точно здобудуть усі золоті медалі.

                        <br/><br/>

                        <b>INTEReco</b> <br/>
                        INTERTOP Ukraine мріє, щоб кожен крок дарував задоволення від руху, користь і радість пізнання світу. Щоб природа навколо — чиста та доглянута. Тому у травні 2019 року за підтримки Міністерства екології та природних ресурсів України ми відкрили першу міську інтерактивну екодоріжку! Заходиш у Національний природний парк «Голосіївський» і маєш попереду 2,7 км, щоб надихнутися природою, відпочити з друзями чи зробити мальовничі фото в Instagram.

                        <br/><br/>

                        Супер, правда? Зізнавайся, вже хочеш долучитися до нашої нестримної та амбітної fashion-сім'ї? Good! Залишилося лише обрати вакансію та надіслати резюме :-) <br/>
                        <a href={"mailto:hr@intertop.ua"} target="_blank">hr@intertop.ua</a>
                    </div>
                );

            case "bakertilly":
                return (
                    <div>
                        <b>Baker Tilly</b> — одна з найбільших та найуспішніших аудиторських та консалтингових компанії України. 20 років ми працюємо для того, щоб допомагати вдосконалювати та розвивати бізнеси наших клієнтів.

                        <br/><br/>

                        Основні напрями діяльності — аудит, податкове та бізнес-консультування, корпоративні фінанси, незалежна оцінка, трансфертне ціноутворення та послуги з бухгалтерського обліку.

                        <br/><br/>

                        <b>Найцінніший наш актив — це наші співробітники.</b> Ми цінуємо в людях бажання реалізувати себе та розкрити свій потенціал, і тому компанія активно інвестує в навчання, професійний та особистісний розвиток працівників.

                        <br/><br/>

                        Націленість на високі стандарти, прагнення бути кращими, відповідальність перед клієнтами, колегами, суспільством, постійний розвиток та командна взаємодія — саме це робить колектив Baker Tilly особливим.

                        <br/><br/>

                        <b>Декілька фактів про нас:</b> <br/>

                        <li>на сьогоднішній день у компанії працюють понад 300 фахівців в Україні</li>
                        <li>офіси компанії розміщуються у Києві, Одесі та Запоріжжі</li>
                        <li>Baker Tilly є членом міжнародної консалтингової мережі Baker Tilly International, яка представлена у 147 країнах світу та входить до ТОП-10 консалтингових компаній світу</li>
                        <li>наші клієнти — це найбільші сільськогосподарські, промислові, виробничі та фінансові компанії України</li>
                        <li>наші цінності — розвиток, професіоналізм, команда та відповідальність — ними ми керуємося у нашій роботі та повсякденному житті</li>
                        <li>кожного дня ми прагнемо створювати для наших співробітників максимально комфортні умови для роботи і даємо можливості для кар'єрного, професійного та особистісного зростання.</li>

                        <br/><br/>

                        Бажаєш побудувати успішну кар'єру, набути професійного досвіду, удосконалити знання та навички і знайти нових друзів – <b>приєднуйся до команди Baker Tilly!</b> Тут ти отримаєш безліч можливостей для свого розвитку, крутий колектив, у якому приємно та цікаво працювати, а також незабутні корпоративні заходи.

                        <br/><br/>

                        І якщо ти думаєш, що потрапити на роботу до такої великої та серйозної аудиторської компанії, як Baker Tilly, надзвичайно складно, то це не так. Ми розвінчали всі міфи щодо працевлаштування у статті "<a href="https://bakertilly.ua/news/id47625" target="_blank">Як стати аудитором у Baker Tilly (і чому тобі сподобається у нас працювати)</a>".

                        <br/><br/>

                        Baker Tilly в Україні — саме та компанія, яка може стати стартом твоєї кар'єри аудитора чи консультанта.  Чекатимемо на твое резюме на <a href="mailto:cv@bakertilly.ua" target="_blank">cv@bakertilly.ua</a>.

                        <br/><br/>

                        <b>Дізнатися більше:</b> <br/>
                        <a href="https://bakertilly.ua/career" target="_blank">https://bakertilly.ua/career</a> <br/>
                        <a href="https://www.facebook.com/bakertillyukraine/" target="_blank">https://www.facebook.com/bakertillyukraine/</a> <br/>
                        <a href="https://www.instagram.com/bakertilly_ukraine/" target="_blank">https://www.instagram.com/bakertilly_ukraine/</a>
                    </div>
                );

            case "roland":
                return (
                    <div>
                        <b>Be what you dream of.</b>

                        <br/><br/>

                        <b>Roland Berger</b>, founded in 1967, is one of the world's leading strategy consultancies. Our consultants advise major international industry and service enterprises as well as public institutions, support financial services companies in their efforts to realign for the future. We help our clients globally and locally to adjust their strategies and organizational structure, optimize their distribution channels, processes and IT landscape, conduct risk management programs, and also implement our services.
                    </div>
                );

            case "bat":
                return (
                    <div>
                        <b>BAT Ukraine</b> - частина провідної міжнародної FMCG компанії з бізнесом у понад <b>180 країнах</b>, який створюють більш ніж <b>53 тисячі співробітників</b>.

                        <br/><br/>

                        <b>Долучайся задля A Better Tomorrow!</b>
                    </div>
                );

            case "pwc":
                return (
                    <div>
                        Уявіть потенціал 276 000 спеціалістів, яких об’єднує спільна мета – формування відносин, що допомагають вам та вашому бізнесу досягати результатів. Це – PwC. Кожного дня наші професіонали працюють разом із вами, щоб досягати тих результатів, на які ви очікуєте.

                        <br/><br/>

                        Фірма PwC присутня на українському ринку з 1993 року. Регіональна мережа включає головний офіс у Києві та представництва у Львові та Дніпрі, що пропонують клієнтам повний спектр послуг. Ми прагнемо надавати аудиторські, податкові, юридичні та консалтингові послуги найвищої якості. Адже наша мета – бути найкращими. Інновації та прагнення досягати найвищого результату становлять основу нашого розвитку. Саме тому PwC вже багато років встановлює стандарти з надання професійних послуг. Наша репутація заснована на побудові довготривалих відносин з нашими клієнтами. У своїй роботі ми намагаємося досягти того результату, на який ви очікуєте.

                        <br/><br/>

                        PwC Україна є учасницею міжнародної мережі фірм PwC, де у 157 країнах працює близько 276 000 фахівців. Клієнти PwC отримують максимальну користь від співпраці з нашими спеціалістами, котрі володіють практичним знанням особливостей місцевого законодавства і бізнес-середовища, та використовують потенціал міжнародної мережі.

                        <br/><br/>

                        {
                            isTabletOrMobileDevice
                                ? (
                                    <iframe
                                        width="320"
                                        height="240"
                                        src="https://www.youtube.com/embed/ToO8ZfGW0Zw">
                                    </iframe>
                                ) : (
                                    <div className="row">
                                        <div className="col-1"/>
                                        <div className="col-10 text-center">
                                            <iframe
                                                width="640"
                                                height="480"
                                                src="https://www.youtube.com/embed/ToO8ZfGW0Zw">
                                            </iframe>
                                        </div>
                                        <div className="col-1"/>
                                    </div>
                                )
                        }
                    </div>
                );

            case "awellum":
                return (
                    <div>

                    </div>
                );

            case "lcf":
                return (
                    <div>

                    </div>
                );

            case "fozzy":
                return (
                    <div>

                    </div>
                );

            case "ancor":
                return (
                    <div>

                    </div>
                );
        }
    }
};
