module.exports = {
    deloitte: "Компанія надає послуги у сфері аудиту, консалтингу, консультування в сфері корпоративних фінансів, управління ризиками, оподаткування",
    jooble: "Українська продуктова ІТ-компанія, яка працює на ринку 71 країни світу",
    ey: "Міжнародна компанія, яка надає послуги у сфері аудиту, оподаткування, супроводу угод і консультування",
    aegis: "Міжнародна комунікаційна група, яка займається розміщенням реклами",
    genesis: "Один з найбільших партнерів Facebook, Google, Snapchat іApple з CEE",
    innoware: "An expert in ERP, CRM, cloud business solutions implementation consulting services",
    integrities: "Юридична фірма повного циклу з головним офісом в Україні",
    jti: "Міжнародний тютюновий бізнес, що представлений у 130 країнах",
    pepsico: "Ми прагнемо бути світовим лідером з виробництва готових до вживання продуктів харчування та напоїв",
    intertop: "Ми тут, щоб занурити світ у комфортний fashion!",
    bakertilly: "Одна з найбільших та найуспішніших аудиторських та консалтингових компанії України",
    roland: "One of the world's leading strategy consultancies",
    bat: "Провідна міжнародна FMCG компанія з бізнесом у понад 180 країнах",
    pwc: "",
    ancor: "",
    lcf: "",
    fozzy: "",
    avellum: "",
};


